In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Extract CSVs into DataFrames
nba_players = "Resources4/nba_salary.csv"
nbaplayers_df = pd.read_csv(nba_players)
nbaplayers_df.head()

              NAME POSITION                 TEAM      SALARY
0     LeBron James       SF  Cleveland Cavaliers  30963450.0
1      Mike Conley       PG    Memphis Grizzlies  26540100.0
2       Al Horford        C       Boston Celtics  26540100.0
3    Dirk Nowitzki       PF     Dallas Mavericks  25000000.0
4  Carmelo Anthony       SF      New York Knicks  24559380.0

In [3]:
nba_teams = "Resources4/nba_team_worth.csv"
nbateams_df = pd.read_csv(nba_teams)
nbateams_df.head()

                    TEAM       WORTH
0        New York Knicks  3300000000
1     Los Angeles Lakers  3000000000
2  Golden State Warriors  2600000000
3          Chicago Bulls  2500000000
4         Boston Celtics  2200000000

In [4]:
# Transform Players Dataframe 
# Create a filtered dataframe from specific columns
nbaplayers_cols = ["NAME", "TEAM", "SALARY"]
nbaplayers_transformed = nbaplayers_df[nbaplayers_cols].copy()

# Rename the Column Headers 
nbaplayers_transformed = nbaplayers_transformed.rename(columns={"NAME": "player_name",
                                                                "TEAM": "team_name",
                                                                "SALARY": "player_salary"})

nbaplayers_transformed.head()

       player_name            team_name  player_salary
0     LeBron James  Cleveland Cavaliers     30963450.0
1      Mike Conley    Memphis Grizzlies     26540100.0
2       Al Horford       Boston Celtics     26540100.0
3    Dirk Nowitzki     Dallas Mavericks     25000000.0
4  Carmelo Anthony      New York Knicks     24559380.0

In [5]:
#Transform Team Dataframe
nbateams_cols = ["TEAM", "WORTH"]
nbateams_transformed = nbateams_df[nbateams_cols].copy()

# Rename the Column Headers 
nbateams_transformed = nbateams_transformed.rename(columns={"TEAM": "team_name"})
nbateams_transformed = nbateams_transformed.rename(columns={"WORTH": "team_worth"})
nbateams_transformed.head()

               team_name  team_worth
0        New York Knicks  3300000000
1     Los Angeles Lakers  3000000000
2  Golden State Warriors  2600000000
3          Chicago Bulls  2500000000
4         Boston Celtics  2200000000

In [6]:
# Create Connection Database
connection_string = "postgres:postgres@localhost:5432/NBA ETL Project"
engine = create_engine(f"postgresql://{connection_string}")

In [ ]:
engine.table_names

In [ ]:
nbaplayers_transformed.to_sql(name='players', con=engine, if_exists='append', index= True)
nbateams_transformed.to_sql(name='teams', con=engine, if_exists='append', index=True)